{
    "id-crypt-start": {
        "goto_node": "id-crypt-enter",
        "intro_text": [
            "The town is actually on the fringes of a much larger settlement that was destroyed long before any dragons threatened it.",
            "This previous settlement had a sewer system and a sizable mausoleum. One hasn't been tended to for a long while. Too long...",
            "",
            "All that remains of the original surface structure is a foundation and a stairwell into the crypt. It beckons to you."
        ]
    },
    "id-crypt-enter": {
        "prompt_text": "What do you do? (Enter or Leave)",
        "parse_input": ["enter", "leave"],
        "enter": "id-crypt-sword",
        "leave": "id-crypt-leave"
    },
    "id-crypt-leave": {
        "goto_node": "id-town-return",
        "intro_text": ["In the end you decide this crypt is no place for humans, and swiftly leave."]
    },
    "id-crypt-sword": {
        "intro_text": [
            "The stale air of the crypt is oppressive, and the steps of the stairwell are all crooked like something has warped them.",
            "Something is wrong with this place...",
            "",
            "The crooked stairs soon become a winding hallway lined with catacombs, and then a large, open chamber.",
            "You spot the sword stuck in the side of a sarcophagus. It gleams in the dark, radiating magic in the heavy air."],
        "prompt_text": "Press enter to try and remove the sword.",
        "roll_dice": [1, 20, 0],
        "item_pickup": ["magic-sword"],
        "roll_success": "id-crypt-skeleton",
        "roll_failure": "id-crypt-skeleton"
    },
    "id-crypt-skeleton": {
        "intro_text": [
            "With some difficulty, you pull the sword out of the stone sarcophagus. You notice the room is quiet.",
            "As you look back to the place it was removed from, you see that it was actually stuck in a skeleton.",
            "A very large skeleton.",
            "",
            "You hear bones clattering from behind you. Quickly, you try to raise your torch to the door, but it's too late.",
            "They're upon you."],
        "item_pickup": ["crypt-done"],
        "goto_node": "id-crypt-wizard-check"
    },
    "id-crypt-wizard-check": {
        "class_check": ["wizard"],
        "check_success": "id-crypt-skeleton-wizard",
        "check_failure": "id-crypt-skeleton-nowizard"
    },
    "id-crypt-skeleton-wizard": {
        "prompt_text": "Roll to determine your fate.",
        "roll_dice": [1,20,10],
        "roll_stats": [["wisdom", 11]],
        "roll_success": "id-crypt-skeleton-wizard-success",
        "roll_failure": "id-crypt-skeleton-wizard-success"
    },
    "id-crypt-skeleton-nowizard": {
        "prompt_text": "Roll to determine your fate.",
        "roll_dice": [1,20,8],
        "roll_success": "id-crypt-skeleton-nowizard-success",
        "roll_failure": "id-crypt-skeleton-fail"
    },
    "id-crypt-skeleton-wizard-success": {
        "intro_text": [
            "The sword held them back before, it can again. You cast a spell of light and surge through the undead.",
            "The faces of the dead smile at you as you part the crowd with the blade. Your feet are swift and your spell holds.",
            "You reach the top of the stairs with the magic sword in hand. The dead watch you leave. Laughing."],
        "goto_node": "id-town-return"
    },
    "id-crypt-skeleton-nowizard-success": {
        "intro_text": [
            "Magical or not, skeletons are brittle. You hold your sword by the blade and ball your fists.",
            "You come at the first one too low and get your hilt stuck in its rib cage. You proceed to use this skeleton as a hammer.",
            "You frantically bash away the risen dead as they crowd the stairway, shaking off the crawling hands and whispering skulls.",
            "You reach the top of the stairs with the magic sword in hand. The dead watch you leave. Clamoring."],
        "goto_node": "id-town-return"
    },
    "id-crypt-skeleton-fail": {
        "intro_text": ["You never leave the mausoleum."],
        "goto_node": "id-game-end"
    }
}
